Repository: 84000/data-translation-memory
Catalog: toh21_84000-the-heart-of-the-perfection-of-wisdom-the-blessed-mother.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ།
en: “The Heart of the Perfection of Wisdom, the Blessed Mother.”

source: བམ་པོ་གཅིག་གོ། །བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to the Perfection of Wisdom, the Blessed Mother!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཕུང་པོའི་རི་ལ། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing on Vulture Peak Mountain at Rājagṛha together with a great saṅgha of monks and a great saṅgha of bodhisattvas.

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཟབ་མོ་སྣང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཀྱི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་སོ།
en: At that time the Blessed One rested in an absorption on the categories of phenomena called illumination of the profound.

source: །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་ཉིད་ལ་རྣམ་པར་ལྟ་ཞིང་། ཕུང་པོ་ལྔ་པོ་དེ་དག་ལ་ཡང་རང་བཞིན་གྱིས་སྟོང་པར་རྣམ་པར་ལྟའོ།
en: At the same time, the bodhisattva great being, noble Avalokiteśvara, while practicing the profound perfection of wisdom, looked and saw that the five aggregates are also empty of an intrinsic nature.

source: །དེ་ནས་སངས་རྒྱས་ཀྱི་མཐུས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་སྤྱད་པར་འདོད་པ་དེས་ཇི་ལྟར་བསླབ་པར་བྱ།
en: Then, due to the Buddha’s power, venerable Śāriputra asked the bodhisattva great being, noble Avalokiteśvara, “How should sons of noble family or daughters of noble family train if they wish to engage in the practice of the profound perfection of wisdom?”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་གིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཤཱ་རིའི་བུ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་སྤྱོད་པ་སྤྱད་པར་འདོད་པ་དེས་འདི་ལྟར་རྣམ་པར་བལྟ་བར་བྱ་སྟེ།
en: The bodhisattva great being, noble Avalokiteśvara, replied to venerable Śāradvatīputra, “Śāriputra, sons of noble family or daughters of noble family who wish to engage in the practice of the profound perfection of wisdom should see things in this way:

source: ཕུང་པོ་ལྔ་པོ་དེ་དག་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པར་རྣམ་པར་ཡང་དག་པར་རྗེས་སུ་བལྟའོ།
en: they should correctly observe the five aggregates to be empty of an intrinsic nature.

source: །གཟུགས་སྟོང་པའོ།
en: “Form is empty. Emptiness is form.

source: །སྟོང་པ་ཉིད་གཟུགས་སོ། །གཟུགས་ལས་སྟོང་པ་ཉིད་གཞན་མ་ཡིན། སྟོང་པ་ཉིད་ལས་ཀྱང་གཟུགས་གཞན་མ་ཡིན་ནོ། །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམས་སྟོང་པའོ།
en: Emptiness is not other than form, and form is also not other than emptiness. In the same way, feeling, perception, formation, and consciousness are empty.

source: །ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དེ།
en: “Śāriputra, therefore, all phenomena are emptiness;

source: མཚན་ཉིད་མེད་པ། མ་སྐྱེས་པ། མ་འགགས་པ། དྲི་མ་མེད་པ། དྲི་མ་དང་བྲལ་བ་མེད་པ། བྲི་བ་མེད་པ།
en: they are without characteristics, unborn, unceasing, without stains, without absence of stains, not deficient, and not complete.

source: གང་བ་མེད་པའོ། །ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་སྟོང་པ་ཉིད་ལ་གཟུགས་མེད། ཚོར་བ་མེད། འདུ་ཤེས་མེད། འདུ་བྱེད་རྣམས་མེད། རྣམ་པར་ཤེས་པ་མེད། མིག་མེད། རྣ་བ་མེད། སྣ་མེད། ལྕེ་མེད། ལུས་མེད། ཡིད་མེད། གཟུགས་མེད། སྒྲ་མེད། དྲི་མེད། རོ་མེད།
en: “Śāriputra, therefore, in emptiness there is no form, no feeling, no perception, no formations, no consciousness, no eye, no ear, no nose, no tongue, no body, no mind, no form, no sound, no smell, no taste, no texture, and no mental object.

source: རེག་བྱ་མེད། ཆོས་མེད་དོ། །མིག་གི་ཁམས་མེད་པ་ནས་ཡིད་ཀྱི་ཁམས་མེད་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་ཀྱི་བར་དུ་ཡང་མེད་དོ།
en: “There is no element of the eye, up to no element of the mind, and further up to no element of the mind consciousness.

source: །མ་རིག་པ་མེད། མ་རིག་པ་ཟད་པ་མེད་པ་ནས་རྒ་ཤི་མེད། རྒ་ཤི་ཟད་པའི་བར་དུ་ཡང་མེད་དོ།
en: “There is no ignorance and no exhaustion of ignorance, up to no aging and death and no exhaustion of aging and death.

source: །སྡུག་བསྔལ་བ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་མེད། ཡེ་ཤེས་མེད། ཐོབ་པ་མེད།
en: “There is no suffering, no origin of suffering, no cessation of suffering, no path, no wisdom, no attainment, and no nonattainment.

source: མ་ཐོབ་པ་ཡང་མེད་དོ། །ཤཱ་རིའི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཐོབ་པ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ཅིང་གནས་ཏེ། སེམས་ལ་སྒྲིབ་པ་མེད་པས་སྐྲག་པ་མེད་དེ།
en: “Śāriputra, therefore, since bodhisattvas have no attainment, they rely upon and dwell in the perfection of wisdom. Because their minds have no veils, they have no fear.

source: ཕྱིན་ཅི་ལོག་ལས་ཤིན་ཏུ་འདས་ནས་མྱ་ངན་ལས་འདས་པའི་མཐར་ཕྱིན་ཏོ།
en: Having utterly gone beyond error, they reach the culmination of nirvāṇa.

source: །དུས་གསུམ་དུ་རྣམ་པར་བཞུགས་པའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྟེན་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: “All the buddhas who reside in the three times have likewise fully awakened to unsurpassed and perfect awakening by relying upon the perfection of wisdom.

source: །དེ་ལྟ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔགས། རིག་པ་ཆེན་པོའི་སྔགས། བླ་ན་མེད་པའི་སྔགས། མི་མཉམ་པ་དང་མཉམ་པའི་སྔགས། སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱེད་པའི་སྔགས།
en: “Therefore, the mantra of the perfection of wisdom is the mantra of great knowledge, the unsurpassed mantra, the mantra that is equal to the unequaled, and the mantra that utterly pacifies all suffering.

source: མི་རྫུན་པས་ན་བདེན་པར་ཤེས་པར་བྱ་སྟེ།
en: Since it is not false, it should be known to be true.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྔགས་སྨྲས་པ།
en: “The mantra of the perfection of wisdom is stated thus:

source: ཏདྱ་ཐཱ།
en: tadyathā gate gate pāragate pārasaṃgate bodhi svāhā

source: ག་ཏེ་ག་ཏེ་པཱ་ར་ག་ཏེ། པཱ་ར་སཾ་ག་ཏེ། བོ་དྷི་སྭཱ་ཧཱ། ཤཱ་རིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་བསླབ་པར་བྱའོ།
en: “Śāriputra, this is the way a bodhisattva great being should train in the profound perfection of wisdom.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ནས། ལེགས་སོ་ལེགས་སོ།
en: Then the Blessed One arose from that absorption and gave his approval to the bodhisattva great being, noble Avalokiteśvara, saying, “Excellent! Excellent!

source: །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ།
en: Son of noble family, it is like that.

source: །རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Son of noble family, it is like that.

source: ཇི་ལྟར་ཁྱོད་ཀྱིས་བསྟན་པ་དེ་བཞིན་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་ལ་སྤྱད་པར་བྱ་སྟེ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱང་རྗེས་སུ་ཡི་རང་ངོ་།
en: The profound perfection of wisdom should be practiced just as you have taught, and even the thus-gone ones will rejoice.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One had said this, venerable Śāradvatīputra, the bodhisattva great being, noble Avalokiteśvara, and the entire assembly, as well as the world with its devas, humans, asuras, and gandharvas, rejoiced and praised what the Blessed One had said.

source: །བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སོ།།
en: This completes The Great Vehicle Sūtra “The Heart of the Perfection of Wisdom, the Blessed Mother.”

source: །།རྒྱ་གར་གྱི་མཁན་པོ་བི་མ་ལ་མི་ཏྲ་དང་། ལོཙྪ་བ་དགེ་སློང་རིན་ཆེན་སྡེས་བསྒྱུར་ཅིང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་དགེ་བློ་དང་ནམ་མཁའ་ལ་སོགས་པས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།།
en: This was translated by the Indian preceptor Vimalamitra and the translator monk Rinchen Dé, and then edited and finalized by the editor-translators Gelo, Namkha, and others.

source: །།དཔལ་བསམ་ཡས་ལྷུན་གྱིས་གྲུབ་པའི་གཙུག་ལག་གི་དགེ་རྒྱས་བྱེ་མ་གླིང་གི་རྩིག་ངོས་ལ་བྲིས་པ་དང་ཞུ་དག་ལེགས་པར་བགྱིས་སོ།།
en: It was then carefully proofed against the writing on the wall of the Gegye Jema Ling Temple at glorious Samye‍—the spontaneously accomplished temple.
